OpenFOAM-10/test/multiphase/multiphaseEulerFoam/interfaceComposition/waterAndIsopropanolEvaporation/system/plot
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

libs            ("libsampling.so");

type            probes;

writeControl    timeStep;
writeInterval   1;

fields
(
    air.gas
    alpha.gas
    alpha.liquid
    H2O.gas
    H2O.liquid
    C3H8O.gas
    C3H8O.liquid
    p
    T.gas
    T.liquid
    interfaceCompositionPhaseChange:Tf.gas_liquid
    dMass.gas
    dMass.liquid
    dMass
    dEnergy.gas
    dEnergy.liquid
    dEnergy
);

probeLocations  ((0 0 0));

// ************************************************************************* //
